import copy

Leader = {
    '李晨': [
        "康兴旺",
        "刘彪",
        "李晨",
        "李樊",
        "刘明一",
        "杨翔宇",
        {
            "number": 212
        }
    ],
    "张稳": [
        "张稳",
        "赵伟",
        "章传喜",
        "曹骏",
        "郭楠",
        {
            "number": 215
        }
    ],
    '苏世超': [
        "苏世超",
        "刘旭辉",
        "李佳林",
        {
            "number": 214
        }
    ],
    "揣星宇": [
        "揣星宇",
        "郝梦畅",
        "李可欣",
        {
            "number": "女生"
        }
    ],
    "邢梓阳": [
        "邢梓阳",
        "王鑫",
        "徐晓杰",
        "徐雪彬",
        "王湜裕",
        "杨宇哲",
        {
            "number": 218
        }

    ],
    "罗琦": [
        "罗琦",
        "李兆林",
        "李昂",
        "刘善宝",
        "吕天乐",
        "李江楠",
        {
            "number": 217
        }
    ],
    "蔡思琦": [
        "辛宇航",
        "蔡思琦",
        "吴卫",
        "高世豪",
        "宇文可豪",
        {
            "number": 213
        }
    ],
    "李尚恒": [
        "李尚恒",
        {
            "number": 620
        }
    ]
}

l = {
    "曹骏": 3137136096,
    "郭楠": 2690681751,
    "李昂": 1340170910,
    "李晨": 591487622,
    "李樊": 3029198839,
    "刘彪": 2096304869,
    "罗琦": 2502013244,
    "王鑫": 2248278179,
    "吴卫": 1473908028,
    "张稳": 1548720908,
    "赵伟": 2392965199,
    "蔡思琦": 1656909554,
    "揣星宇": 2086798102,
    "高世豪": 498661819,
    "郝梦畅": 1208067561,
    "康兴旺": 2315143636,
    "李佳林": 1306791767,
    "李江楠": 1009740561,
    "李可欣": 1092896132,
    "李尚恒": 1332250851,
    "李兆林": 2697951507,
    "刘明一": 1351244826,
    "刘善宝": 1395896975,
    "刘旭辉": 775373008,
    "吕天乐": 747920501,
    "苏世超": 292301843,
    "王湜裕": 835017638,
    "辛宇航": 953725247,
    "邢梓阳": 2209906415,
    "徐晓杰": 2817605916,
    "徐雪彬": 2417933635,
    "杨翔宇": 1950381153,
    "杨宇哲": 2212607441,
    "宇文可豪": 1625290298,
    "章传喜": 2811165455,
    "周超": 1000000000
}

s = set()

content = []
for leader in Leader:
    info = {'leader': leader, 'index': str(Leader.get(str(leader))[-1]['number']) + "宿舍", "member": []}
    for people in l:
        if people in Leader.get(leader):
            s.add(leader)
            info['member'].append(people)
    if len(info['member']) != 0:
        content.append(info)

def comp(e):
    return e['index']


content.sort(key=comp)
print(type(content))
for i in content:
    print(i)
